Тест_ЗУП_31_КОРП/src/Documents/ЗаявкаНаЕдиновременнуюКомпенсацию/ЗаявкаНаЕдиновременнуюКомпенсацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаЕдиновременнуюКомпенсацию</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаявки</name>
    <type>
      <types>CatalogRef.ВидыЗаявокНаЕдиновременнуюКомпенсациюСотрудникам</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсправленныйДокумент</name>
    <type>
      <types>DocumentRef.ЗаявкаНаЕдиновременнуюКомпенсацию</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассмотрел</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРассмотрения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаОбработана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/Enums/СтатусыЗаявокСотрудников/СтатусыЗаявокСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявокСотрудников</name>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>Рассматривается</name>
  </enumValues>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>Подготовлено</name>
  </enumValues>
  <enumValues>
    <name>Отозвано</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Documents/ОтменаЗаявкиНаЕдиновременнуюКомпенсацию/ОтменаЗаявкиНаЕдиновременнуюКомпенсацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтменаЗаявкиНаЕдиновременнуюКомпенсацию</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаСотрудника</name>
    <type>
      <types>DocumentRef.ЗаявкаНаЕдиновременнуюКомпенсацию</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/Documents/ЗаявкаНаЕдиновременнуюКомпенсацию/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, Новый Структура("Ответственный", "Объект.Ответственный"));
		
		ИнициализироватьФорму();
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ИнициализироватьФорму();
	
	ОбменДаннымиЗарплатаКадры.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписанДокументЗаявкаНаЕдиновременнуюКомпенсацию", , ЭтаФорма);
	
	ИсправлениеДокументовЗарплатаКадрыКлиент.ОповеститьОбИсправленииДокумента(Объект.Ссылка, Объект.ИсправленныйДокумент, ПараметрыЗаписи.РежимЗаписи, "ПериодическиеСведения");
	Оповестить("ЗаписьДокумента", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = "ЗаписанДокументЗаявкаНаЕдиновременнуюКомпенсацию" И Источник.ВладелецФормы = ЭтаФорма)
		Или (ИмяСобытия = "ЗаписанДокументОтменаЗаявкиНаЕдиновременнуюКомпенсацию" И Источник.ВладелецФормы = ЭтаФорма) Тогда
		ПриПолученииДанныхНаСервере();
	КонецЕсли;
	ИсправлениеДокументовЗарплатаКадрыКлиент.ОбработкаОповещенияИсправленногоДокумента(ЭтотОбъект, Объект.Ссылка, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОформитьДоходВНатуральнойФорме(Команда)
	
	СамообслуживаниеСотрудниковКлиент.ОформитьКадровыйПриказ(ЭтаФорма, "ДоходВНатуральнойФорме", ДанныеЗаявкиСотрудника(ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьМатериальнуюПомощь(Команда)
	
	СамообслуживаниеСотрудниковКлиент.ОформитьКадровыйПриказ(ЭтаФорма, "МатериальнаяПомощь", ДанныеЗаявкиСотрудника(ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьРазовоеНачисление(Команда)
	
	СамообслуживаниеСотрудниковКлиент.ОформитьКадровыйПриказ(ЭтаФорма, "РазовоеНачисление", ДанныеЗаявкиСотрудника(ЭтаФорма));
	
КонецПроцедуры

#Область ИсправлениеДокументов

&НаКлиенте
Процедура Подключаемый_Исправить(Команда)
	ИсправлениеДокументовЗарплатаКадрыКлиент.Исправить(Объект.Ссылка, "ЗаявкаНаЕдиновременнуюКомпенсацию");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПерейтиКИсправлению(Команда)
	ИсправлениеДокументовЗарплатаКадрыКлиент.ПерейтиКИсправлению(ЭтаФорма.ДокументИсправление, "ЗаявкаНаЕдиновременнуюКомпенсацию");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПерейтиКИсправленному(Команда)
	ИсправлениеДокументовЗарплатаКадрыКлиент.ПерейтиКИсправленному(Объект.ИсправленныйДокумент, "ЗаявкаНаЕдиновременнуюКомпенсацию");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Отменить(Команда)
	
	ЗначенияЗаполнения = Новый Структура("ЗаявкаСотрудника, ФизическоеЛицо", Объект.Ссылка, Объект.ФизическоеЛицо);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Документ.ОтменаЗаявкиНаЕдиновременнуюКомпенсацию.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПерейтиКДокументуОтмены(Команда)

	ПараметрыФормы = Новый Структура("Ключ", ЭтотОбъект.ДокументОтменаЗаявки);
	ОткрытьФорму("Документ.ОтменаЗаявкиНаЕдиновременнуюКомпенсацию.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Отозвать(Команда)
	
	ОтозватьЗаявкуНаСервере();
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Согласовать(Команда)
	
	СогласоватьЗаявкуНаСервере();
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Отклонить(Команда)
	
	ОтклонитьЗаявкуНаСервере();
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьФорму()
	
	Параметры.Свойство("РежимМоиЗаявки", РежимМоиЗаявки);
	
	ИсправлениеДокументовЗарплатаКадры.ГруппаИсправлениеДополнитьФорму(ЭтаФорма, Истина, Ложь);
	СамообслуживаниеСотрудников.ГруппаИсправлениеДополнитьФорму(ЭтаФорма);
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	ИсправлениеДокументовЗарплатаКадры.ПрочитатьРеквизитыИсправления(ЭтаФорма, "ПериодическиеСведения");
	Если Не ЭтаФорма.Параметры.Ключ.Пустая() Тогда
		СамообслуживаниеСотрудников.ПрочитатьРеквизитыИсправления(ЭтаФорма);
	КонецЕсли;
	ИсправлениеДокументовЗарплатаКадрыКлиентСервер.УстановитьПоляИсправления(ЭтаФорма, "ПериодическиеСведения");
	
	СамообслуживаниеСотрудников.УстановитьПоляИсправления(ЭтаФорма);
	СамообслуживаниеСотрудников.УстановитьВидимостьЭлементовЗаявки(ЭтаФорма);
	
	УстановитьВидимостьКоманд();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаявкаОбработана", "ТолькоПросмотр", РежимМоиЗаявки);
	
КонецПроцедуры

&НаСервере
Процедура ОтозватьЗаявкуНаСервере()
	
	СамообслуживаниеСотрудников.ОтозватьЗаявку(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура СогласоватьЗаявкуНаСервере()
	
	СамообслуживаниеСотрудников.СогласоватьЗаявку(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОтклонитьЗаявкуНаСервере()
	
	СамообслуживаниеСотрудников.ОтклонитьЗаявку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДанныеЗаявкиСотрудника(Форма)
	
	Объект = Форма.Объект;
	
	ДанныеЗаявки = Новый Структура;
	ДанныеЗаявки.Вставить("ФизическоеЛицо", Объект.ФизическоеЛицо);
	ДанныеЗаявки.Вставить("Сумма", Объект.Сумма);
	
	Возврат ДанныеЗаявки;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьКоманд()
	
	ДоступноСогласование = Пользователи.РолиДоступны("СогласованиеЗаявокНаЕдиновременнуюКомпенсацию");
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Согласовать", "Видимость", ДоступноСогласование);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Отклонить", "Видимость", ДоступноСогласование);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСоздать", 
		"Видимость", Объект.Проведен И Объект.Статус = Перечисления.СтатусыЗаявокСотрудников.Согласовано);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОформитьДоходВНатуральнойФорме", "Видимость", 
		ПолучитьФункциональнуюОпцию("ИспользоватьДоходыВНатуральнойФорме") И ПравоДоступа("Добавление", Метаданные.Документы.ДоходВНатуральнойФорме));
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОформитьМатериальнуюПомощь", "Видимость", 
		ПолучитьФункциональнуюОпцию("ИспользоватьМатериальнуюПомощь") И ПравоДоступа("Добавление", Метаданные.Документы.МатериальнаяПомощь));
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОформитьРазовоеНачисление", "Видимость", 
		ПолучитьФункциональнуюОпцию("НачислятьРазовыеНачисленияОтдельнымДокументом") И ПравоДоступа("Добавление", Метаданные.Документы.РазовоеНачисление));
		
КонецПроцедуры

#КонецОбласти
